Repository: idris-lang/Idris-dev
Catalog: docs/locale/*/LC_MESSAGES/tutorial/introduction.po
Languages: ru

source: Introduction
ru: Введение

source: In conventional programming languages, there is a clear distinction between *types* and *values*. For example, in `Haskell <http://www.haskell.org>`_, the following are types, representing integers, characters, lists of characters, and lists of any value respectively:
ru: В традиционных языках программирования, есть четкое различие между *типами* и *значениями*. К примеру, в `Haskell <http://www.haskell.org>`_, ниже перечислены типы, представляющие целые числа, символы, списки символов, и списки любого значения соответственно:

source: Correspondingly, the following values are examples of inhabitants of those types:
ru: Соответственно, следующие примеры являются примерами значений этих типов:

source: In a language with *dependent types*, however, the distinction is less clear. Dependent types allow types to “depend” on values — in other words, types are a *first class* language construct and can be manipulated like any other value. The standard example is the type of lists of a given length [1]_, ``Vect n a``, where ``a`` is the element type and ``n`` is the length of the list and can be an arbitrary term.
ru: В языке с *зависимыми типами*, однако, это различие менее заметно. Зависимые типы позволяют типам *зависеть* от значений - другими словами,типы - это языковая конструкция языка *первого класса* и ими можно манипулировать, как любыми другими значениями. Стандартным примером является тип списков заданной длины (вектор) [1]_, ``Vect n a``, где ``a`` является типом элемента, а ``n`` длиной списка.

source: When types can contain values, and where those values describe properties, for example the length of a list, the type of a function can begin to describe its own properties. Take for example the concatenation of two lists. This operation has the property that the resulting list's length is the sum of the lengths of the two input lists. We can therefore give the following type to the ``app`` function, which concatenates vectors:
ru: Когда типы могут содержать значения, и эти значения описывают свойства, например длина списка, тип функции может описывать свои свойства. Возьмем, к примеру конкатенацию двух списков. Эта операция обладает свойством, длиной результирующего списка, которая является суммой длин двух входных списков. Возможно задать следующий тип для ``app`` функции, которые объединяет векторы:

source: This tutorial introduces Idris, a general purpose functional programming language with dependent types. The goal of the Idris project is to build a dependently typed language suitable for verifiable *systems* programming. To this end, Idris is a compiled language which aims to generate efficient executable code. It also has a lightweight foreign function interface which allows easy interaction with external ``C`` libraries.
ru: Это руководство обучает основным принципам работы с языком программирования Idris, функциональным языком программирования общего назначения с зависимыми типами. Целью проекта Idris является создание языка программирования с зависимыми типами подходящего для проверяемых *систем* программирования. Idris является компилируемым языком, направленным на получение эффективного исполняемого кода. Он также имеет легковесный интерфейс вызова сторронних функций, это позволяет легко взаимодействовать с внешними ``C`` библиотеками.

source: Intended Audience
ru: Целевая аудитория

source: This tutorial is intended as a brief introduction to the language, and is aimed at readers already familiar with a functional language such as `Haskell <http://www.haskell.org>`_ or `OCaml <http://ocaml.org>`_. In particular, a certain amount of familiarity with Haskell syntax is assumed, although most concepts will at least be explained briefly. The reader is also assumed to have some interest in using dependent types for writing and verifying systems software.
ru: Это краткое введение в язык и предназначено для читателей уже знакомых с функциональным программированиями и такими языками как: `Haskell <http://www.haskell.org>`_ или `OCaml <http://ocaml.org>`_. Вчастности, предполагается определенное знакомство с синтаксисом Haskell,но значение большинства понятий будет кратко изложено. Также предполагается, что у читателя есть заинтересованность в использовании зависимых типов в области разработки и верификации программного обеспечения.

source: Example Code
ru: Пример кода

source: This tutorial includes some example code, which has been tested with against Idris. These files are available with the Idris distribution, so that you can try them out easily. They can be found under ``samples``. It is, however, strongly recommended that you type them in yourself, rather than simply loading and reading them.
ru: Эти примеры доступны из дистрибутива Idris и вы сами можете всё это попробовать. Они могут быть найдены в директории ``samples``. Но всё же, настоятельно рекомендуется, что вы сами используете их код, а не просто копируете исходный код примеров.

source: Typically, and perhaps confusingly, referred to in the dependently typed programming literature as “vectors”
ru: В литературе программирования с зависимыми типами обозначаются как “векторы”
