Repository: idris-lang/Idris-dev
Catalog: docs/locale/*/LC_MESSAGES/tutorial/typesfuns.po
Languages: ru

source: If the same implicit arguments are being used a lot, it can make a definition difficult to read. To avoid this problem, a ``using`` block gives the types and ordering of any implicit arguments which can appear within the block:
ru: Если же неявные аргументы используются часто, это трудно читать. Чтобы избежать такой проблемы ``using`` блок задаёт типы и порядок предоставления каких-либо неявных аргументов, которые могут появиться в блоке:

source: Note: Declaration Order and ``mutual`` blocks
ru: Примечание: порядок объявления и ``mutual`` блоки

source: In general, functions and data types must be defined before use, since dependent types allow functions to appear as part of types, and their reduction behaviour to affect type checking. However, this restriction can be relaxed by using a ``mutual`` block, which allows data types and functions to be defined simultaneously:
ru: В целом, функции и типы данных должны быть определены до использования, так как зависимые типы позволяют функции выступать в качестве части типов, и их редукция влияет на проверку типа. Тем не менее, это ограничение может быть смягчено с помощью ``mutual`` блока, который позволяет типам данных и функциям быть объявлеными одновременно:

source: In a ``mutual`` block, first all of the type declarations are added, then the function bodies. As a result, none of the function types can depend on the reduction behaviour of any of the functions in the block.
ru: В ``mutual`` блоках сперва следуют объявления типов, а затем функций. В результате ни один из типов функции не может зависеть от редукции любой из функций в блоке.

source: Computer programs are of little use if they do not interact with the user or the system in some way. The difficulty in a pure language such as Idris — that is, a language where expressions do not have side-effects — is that I/O is inherently side-effecting. Therefore in Idris, such interactions are encapsulated in the type ``IO``:
ru: Компьютерные программы имеют тенденцию взаимодействия с пользователем, или системой в каком-то виде. Одной из трудностей в чистом языке программирования,где выражения не имеют побочных эффектов - это взаимодействия с IO, что влечёт за собой побочные эффекты. Поэтому в Idris такие взаимодействия заключены в тип ``IO``:

source: We’ll leave the definition of ``IO`` abstract, but effectively it describes what the I/O operations to be executed are, rather than how to execute them. The resulting operations are executed externally, by the run-time system. We’ve already seen one IO program:
ru: Мы оставим определение ``IO`` абстрактным, но эффективно он описывает то, что операции ввода/вывода будут выполнены, а не как их выполнять. Полученные операции выполняются внешней системой. Мы уже видели одну программу IO:

source: The type of ``putStrLn`` explains that it takes a string, and returns an element of the unit type ``()`` via an I/O action. There is a variant ``putStr`` which outputs a string without a newline:
ru: Тип ``putStrLn`` говорит о том, что он принимает строку и возвращает элемент типа ``()`` с помощью действия I/O. Существует вариант ``putStr`` который выводит строку без символа новой строки:

source: We can also read strings from user input:
ru: Мы также можем прочитать строки введённые пользователем:

source: A number of other I/O operations are defined in the prelude, for example for reading and writing files, including:
ru: Ряд других операций ввода/вывода определен в Prelude бибилиотеке, например, для чтение и записи файлов:

source: “``do``” notation
ru: “``do``” нотация

source: I/O programs will typically need to sequence actions, feeding the output of one computation into the input of the next. ``IO`` is an abstract type, however, so we can’t access the result of a computation directly. Instead, we sequence operations with ``do`` notation:
ru: I/O программы, как правило, нуждаются в упорядоченности действий, где выход одного вычисления идёт на вход следующего. ``IO`` - это абстрактный тип, однако, таким образом, мы не можем получить доступ к результату вычислений непосредственно. Вместо этого, мы выполняем операции последовательно с использованием ``do`` нотации:

source: The syntax ``x <- iovalue`` executes the I/O operation ``iovalue``, of type ``IO a``, and puts the result, of type ``a`` into the variable ``x``. In this case, ``getLine`` returns an ``IO String``, so ``name`` has type ``String``. Indentation is significant — each statement in the do block must begin in the same column. The ``return`` operation allows us to inject a value directly into an IO operation:
ru: Синтаксис ``х <- iovalue`` выполняет операцию ввова/вывода ``iovalue``, типа ``IO a`` и помещает результат типа ``a`` в переменную ``x``. В этом случае, ``getLine`` возвращает ``IO String``, так ``name`` имеет тип ``String``. Отступ является важной частью синтаксиса - каждый оператор в блоке должен начнется в той же колонке. Операция ``return`` позволяет передать значение непосредственно в операции ввода-вывода:

source: As we will see later, ``do`` notation is more general than this, and can be overloaded.
ru: Как мы увидим позже, ``do`` нотация имеет более общее значение и может быть перегружена.

source: Laziness
ru: Ленивость (отложенные вычисления)

source: Normally, arguments to functions are evaluated before the function itself (that is, Idris uses *eager* evaluation). However, this is not always the best approach. Consider the following function:
ru: Как правило, аргументы функций вычисляются перед самой функцией (то есть, Idris использует *нетерпеливые* вычисления). Тем не менее, это не всегда лучший подход. Рассмотрим следующую функцию:

source: This function uses one of the ``t`` or ``e`` arguments, but not both (in fact, this is used to implement the ``if...then...else`` construct as we will see later. We would prefer if *only* the argument which was used was evaluated. To achieve this, Idris provides a ``Lazy`` data type, which allows evaluation to be suspended:
ru: Эта функция использует один из аргументов: ``t`` или ``e``, но не оба.(фактически, это используется для реализации ``if...then...else``, как мы увидим позже) Мы предпочли бы, если бы *только* один аргумент, который был использован был выполнен. Чтобы добиться этого, Идрис обеспечивает ``Lazy`` тип данных, которые позволяют вычислениям быть *подвешенными*:

source: A value of type ``Lazy a`` is unevaluated until it is forced by ``Force``. The Idris type checker knows about the ``Lazy`` type, and inserts conversions where necessary between ``Lazy a`` and ``a``, and vice versa. We can therefore write ``ifThenElse`` as follows, without any explicit use of ``Force`` or ``Delay``:
ru: Значение типа ``Lazy a`` является невычисленным до тех пор, пока он не вынужден с помощью ``Force``. Механизм проверки типов Idris знает о ``Lazy`` типах, и делает вставки преобразований между ``Lazy a`` и ``a``, и наоборот. Поэтому мы может написать ``ifThenElse`` без явного использования ``Force`` или ``Delay``:

source: Useful Data Types
ru: Полезные типы данных

source: Idris includes a number of useful data types and library functions (see the ``libs/`` directory in the distribution). This chapter describes a few of these. The functions described here are imported automatically by every Idris program, as part of ``Prelude.idr``.
ru: Idris включает в себя ряд полезных типов данных и функций библиотеки (см ``libs/`` directory in the distribution). В этой главе описывается несколько этих функций. Они импортированы автоматически в рамках``Prelude.idr``.

source: ``List`` and ``Vect``
ru: ``List`` и ``Vect``

source: We have already seen the ``List`` and ``Vect`` data types:
ru: Мы уже видели ``List`` и ``Vect`` типы данных:

source: Note that the constructor names are the same for each — constructor names (in fact, names in general) can be overloaded, provided that they are declared in different namespaces (see Section :ref:`sect-namespaces`), and will typically be resolved according to their type. As syntactic sugar, any type with the constructor names ``Nil`` and ``::`` can be written in list form. For example:
ru: Обратите внимание, что имена конструкторов являются одинаковыми для всех, имена конструкторов (на самом деле, имена в целом) могут быть перегружены при условии, что они объявлены в разных пространствах имен (см раздел :ref:`sect-namespaces`), и как правило, будет решен в соответствии с их типом. Любой тип с именами конструктора ``Nil`` и ``::`` можно записать в список. Например:

source: ``[]`` means ``Nil``
ru: ``[]`` обозначает ``Nil``

source: ``[1,2,3]`` means ``1 :: 2 :: 3 :: Nil``
ru: ``[1,2,3]`` обозначает ``1 :: 2 :: 3 :: Nil``

source: The library also defines a number of functions for manipulating these types. ``map`` is overloaded both for ``List`` and ``Vect`` and applies a function to every element of the list or vector.
ru: Библиотека также определяет ряд функций для манипулирования этими типами. ``map`` перегружен как для ``List`` и ``Vect`` и применяет функцию к каждому элементу списка или вектора.

source: For example, given the following vector of integers, and a function to double an integer:
ru: Например, если это вектор целых чисел, и функция удвоения целого числа:

source: the function ``map`` can be used as follows to double every element in the vector:
ru: Функцию ``map`` можно использовать следующим образом и удвоить каждый элемент в векторе:

source: You’ll find these examples in ``usefultypes.idr`` in the ``examples/`` directory. For more details of the functions available on ``List`` and ``Vect``, look in the library files:
ru: Вы найдете эти примеры в ``usefultypes.idr`` в ``examples/`` каталоге. Для более подробной информации о функциях, доступных в ``List`` и ``Vect``, посмотрите в файлах библиотеки:

source: Functions include filtering, appending, reversing, and so on. Also remember that Idris is still in development, so if you don’t see the function you need, please feel free to add it and submit a patch!
ru: Функции включают в себя фильтрацию, добавление, реверс и так далее. Кроме того, помните, что Idris еще находится в разработке, так что если вы не видите функций, которые вам требуются, пожалуйста, не стесняйтесь в том, чтобы добавить их и предоставляйте патчи!

source: Aside: Anonymous functions and operator sections
ru: Анонимные функции и секции операторов

source: There are actually neater ways to write the above expression. One way would be to use an anonymous function:
ru: Есть более аккуратные способы написать приведенное выше выражение. Один из способов с использовнием анонимной функции:

source: The notation ``\x => val`` constructs an anonymous function which takes one argument, ``x`` and returns the expression ``val``. Anonymous functions may take several arguments, separated by commas, e.g. ``\x, y, z => val``. Arguments may also be given explicit types, e.g. ``\x : Int => x * 2``, and can pattern match, e.g. ``\(x, y) => x + y``. We could also use an operator section:
ru: Нотация ``\x => val`` строит анонимную функцию, которая принимает один аргумент, ``x`` и возвращает выражение ``val``. Анонимные функции могут иметь несколько аргументов, разделенных запятыми, например, ``\x, y, z => val``. Аргументы также могут быть даны явными типами, например, ``\x : Int => x * 2`` и шаблонами, например, ``\(x, y) => x + y``. Возможно также использовать секцию операторов:

source: ``(*2)`` is shorthand for a function which multiplies a number by 2. It expands to ``\x => x * 2``. Similarly, ``(2*)`` would expand to ``\x => 2 * x``.
ru: ``(* 2)`` является сокращением для функции, которая умножает число на 2. Расширяется до ``\x => x * 2``. Точно так же, ``(2*)`` расширится в ``\x => 2 * x``.

source: ``Maybe`` describes an optional value. Either there is a value of the given type, or there isn’t:
ru: ``Maybe`` описывает необязательное значение:

source: ``Maybe`` is one way of giving a type to an operation that may fail. For example, looking something up in a ``List`` (rather than a vector) may result in an out of bounds error:
ru: ``Maybe`` является одним из способов дать тип операции, которая может неправильно отработать, например, в случае с ``List`` (вместо вектора), может выйти за границы сриска:

source: The ``maybe`` function is used to process values of type ``Maybe``, either by applying a function to the value, if there is one, or by providing a default value:
ru: Функция ``maybe`` используется для обработки значения типа ``Maybe``, либо путем применения функции к значению, если есть значение, или предоставления значения по умолчанию:

source: Note that the type of the first argument is ``Lazy b`` rather than simply ``b``. Since the default value might not be used, we mark it as ``Lazy`` in case it is a large expression where evaluating it then discarding it would be wasteful.
ru: Обратите внимание, что тип первого аргумента ``Lazy b``, а не просто ``b``. Так как значения по умолчанию не могут быть использованы, мы отмечаем их как ``Lazy``, так как в случае большого выражения, вычесление

source: Tuples and Dependent Pairs
ru: Кортежи и зависимые пары

source: Values can be paired with the following built-in data type:
ru: Значения могут быть в паре со следующим встроенным типом данных

source: As syntactic sugar, we can write ``(a, b)`` which, according to context, means either ``Pair a b`` or ``MkPair a b``. Tuples can contain an arbitrary number of values, represented as nested pairs:
ru: Как синтаксический сахар, мы можем написать ``(a, b)``, в зависимости от контекста это означает либо ``Pair a b`` или ``MkPair a b``. Кортежи могут содержать произвольное количество значений:

source: Dependent Pairs
ru: Зависимые пары

source: Dependent pairs allow the type of the second element of a pair to depend on the value of the first element. Traditionally, these are referred to as “sigma types”:
ru: Зависимые пары позволяют типу второго элемента пары зависеть от значения первого элемента. Традиционно, они упоминаются как “сигма типы”:

source: Again, there is syntactic sugar for this. ``(a : A ** P)`` is the type of a pair of A and P, where the name ``a`` can occur inside ``P``. ``( a ** p )`` constructs a value of this type. For example, we can pair a number with a ``Vect`` of a particular length.
ru: Опять же, есть синтаксический сахар для этого. ``(a : A ** P)`` является типом пара А и Р, где ``a`` может быть внутри ``P``. ``( a ** p )`` строит значение этого типа. Например, мы можем соединить число с ``Vect`` из определенной длины.

source: If you like, you can write it out the long way, the two are precisely equivalent.
ru: Если вы хотите, вы можете написать это долгим путём. Это будет эквивалентно предыдущему примру.

source: The type checker could of course infer the value of the first element from the length of the vector. We can write an underscore ``_`` in place of values which we expect the type checker to fill in, so the above definition could also be written as:
ru: Механизм проверки типов может, конечно, сделать вывод значения первого элемента из длины вектора. Мы можем написать подчеркивания ``_`` вместо значений, которые мы ожидаем, что механизм проверки типов заполнит, поэтому приведенное выше определение также может быть записано в виде:

source: We might also prefer to omit the type of the first element of the pair, since, again, it can be inferred:
ru: Мы могли бы также опустить тип первого элемента пары:

source: One use for dependent pairs is to return values of dependent types where the index is not necessarily known in advance. For example, if we filter elements out of a ``Vect`` according to some predicate, we will not know in advance what the length of the resulting vector will be:
ru: Один из вариантов использования для зависимых пар - это возврат значений зависимых типов, где индекс не обязательно известен заранее. Например, если мы фильтруем элементы из ``Vect`` по некоторым предикатом, мы не знаем, заранее длину результирующего вектора:

source: If the ``Vect`` is empty, the result is easy:
ru: Если ``Vect`` пуст, результат легко получить:

source: In the ``::`` case, we need to inspect the result of a recursive call to ``filter`` to extract the length and the vector from the result. To do this, we use ``with`` notation, which allows pattern matching on intermediate values:
ru: В случае ``::``, мы должны проверить результат рекурсивного вызова к ``filter`` и извлечь длину из результата. Для этого мы используем ``with`` нотацию, которая выполняет сопоставление с образцом на промежуточном значении:

source: We will see more on ``with`` notation later.
ru: Мы увидим больше ``with`` нотации позже.

source: More Expressions
ru: Другие выражения

source: ``let`` bindings
ru: ``let`` привязки

source: Intermediate values can be calculated using ``let`` bindings:
ru: Промежуточные значения могут быть рассчитаны с использованием ``let`` привязки:

source: We can do simple pattern matching in ``let`` bindings too. For example, we can extract fields from a record as follows, as well as by pattern matching at the top level:
ru: Мы можем делать сопоставление с шаблоном в ``let`` привязке. Например, мы может извлекать поля из записи, а также делать сопоставление с образцом на высшем уровне:

source: List comprehensions
ru: Списковые выражения

source: Idris provides *comprehension* notation as a convenient shorthand for building lists. The general form is:
ru: Идрис принимает *списковые выражения* как сокращение для построения списков. Общая форма:

source: This generates the list of values produced by evaluating the ``expression``, according to the conditions given by the comma separated ``qualifiers``. For example, we can build a list of Pythagorean triples as follows:
ru: Это создает список значений, полученных путем выполнения ``expression``, в соответствии с условиями ``qualifiers`` через запятую. Например, мы можем построить список из троек Пифагора следующим образом:

source: The ``[a..b]`` notation is another shorthand which builds a list of numbers between ``a`` and ``b``. Alternatively ``[a,b..c]`` builds a list of numbers between ``a`` and ``c`` with the increment specified by the difference between ``a`` and ``b``. This works for any numeric type, using the ``count`` function from the prelude.
ru: ``[a..b]`` обозначения другого сокращение которое строит список номеров между ``a`` и ``b``. ``[, b..c]` `строит список номеров между ``a`` и ``c`` с приращением указанной разницы между ``a`` и ``b``. Это работает для любого числового типа, использующего ``count`` функцию от Prelude библиотеке.

source: ``case`` expressions
ru: ``case`` выражения

source: Another way of inspecting intermediate values of *simple* types is to use a ``case`` expression. The following function, for example, splits a string into two at a given character:
ru: Еще один способ проверки промежуточных значений *простых* типов, ``case`` выражения. Следующая функция, например, разбивает строку на две в положении указанного символа:

source: ``break`` is a library function which breaks a string into a pair of strings at the point where the given function returns true. We then deconstruct the pair it returns, and remove the first character of the second string.
ru: ``break`` - это библиотечная функция, которая разбивает строку в пару строк в точке, где указанная функция возвращает истину. Мы деконструируем возвращаемое значение и удаляем первый символ второй строки.

source: A ``case`` expression can match several cases, for example, to inspect an intermediate value of type ``Maybe a``. Recall ``list_lookup`` which looks up an index in a list, returning ``Nothing`` if the index is out of bounds. We can use this to write ``lookup_default``, which looks up an index and returns a default value if the index is out of bounds:
ru: ``case`` выражение может охватывать несколько случаев, например, для проверки промежуточное значение типа ``Maybe a``. Напомним ``list_lookup`` который находит индекс в списке или ``Nothing`` если индекс вне границ.Мы можем использовать это, чтобы написать ``lookup_default``, который ищет индекс и возвращает значение по умолчанию, если индекс вне границ:

source: If the index is in bounds, we get the value at that index, otherwise we get a default value:
ru: Если индекс находится в пределах, мы получаем значение по этому индексу, в противном случае мы получим значение по умолчанию:

source: **Restrictions:** The ``case`` construct is intended for simple analysis of intermediate expressions to avoid the need to write auxiliary functions, and is also used internally to implement pattern matching ``let`` and lambda bindings. It will *only* work if:
ru: **Ограничение** ``case`` конструкция предназначена для простого анализа промежуточные выражения, чтобы избежать необходимости писать вспомогательные функции, и также используется внутренне, чтобы реализовать шаблон ``let`` и лямбда привязки. Это работает при соблюдении следующих условий:

source: Each branch *matches* a value of the same type, and *returns* a
ru: Каждая ветвь *совпадает* по возвращаемому типу

source: value of the same type.
ru: значение того же типа

source: The type of the result is "known". i.e. the type of the expression
ru: Выходной тип выражения должен быть известен

source: can be determined *without* type checking the ``case``-expression itself.
ru: может быть определен *без* проверки типа самого ``case``-выражения.

source: Dependent Records
ru: Зависимые записи

source: *Records* are data types which collect several values (the record's *fields*) together. Idris provides syntax for defining records and *automatically generating field access and update functions*. For example, we can represent a person's name and age in a record:
ru: *Записи* - это типы данных, которые собирают несколько значений (запись в *поля*) вместе. Idris обеспечивает синтаксис для определения записи и *автоматической генерации доступа к полям и функциям обновления*. Например, мы можем представить имя человека и возраст в записи:

source: Records can have *parameters*, which are listed between the record name and the ``where`` keyword, and *fields*, which are in an indented block following the `where` keyword (here, ``name`` and ``age``). The constructor name is provided after the ``constructor`` keyword. The field names can be used to access the field values:
ru: Записи могут иметь *параметры*, которые перечислены между именем записи и ``where`` и *поля*, в блоке после ``where`` (здесь ``name`` и ``age``). Конструктор помещен после ключевого слова ``constructor``. Имена полей могут быть используемы для доступа к значениям полей:

source: We can also use the field names to update a record (or, more precisely, produce a copy of the record with the given fields updated):
ru: Мы также можем использовать имена полей, чтобы обновить запись (или, точнее, произвести копию записи и записать в поле обновленную запись):

source: The syntax ``record { field = val, ... }`` generates a function which updates the given fields in a record.
ru: Синтаксис ``record { field = val, ... }`` генерирует функцию, котораяобновляет данные поля в записи.

source: Records, and fields within records, can have dependent types. Updates are allowed to change the type of a field, provided that the result is well-typed.
ru: Записи и поля в записях, могут иметь зависимые типы. Обновления разрешаются для типов полей, при условии, что значения соответствуют типам.

source: It is safe to update the ``students`` field to a vector of a different length because it will not affect the type of the record:
ru: Это безопасно обновить длину ``students``, потому что это не повлияет на тип записи:

source: Nested record update
ru: Обновление вложенных записей
