Repository: idris-lang/Idris-dev
Catalog: docs/locale/*/LC_MESSAGES/tutorial/typesfuns.po
Languages: ru

source: Types and Functions
ru: Типы и функции

source: Primitive Types
ru: Примитивные (базовые) типы

source: Idris defines several primitive types: ``Int``, ``Integer`` and ``Float`` for numeric operations, ``Char`` and ``String`` for text manipulation, and ``Ptr`` which represents foreign pointers. There are also several data types declared in the library, including ``Bool``, with values ``True`` and ``False``. We can declare some constants with these types. Enter the following into a file ``Prims.idr`` and load it into the Idris interactive environment by typing ``idris Prims.idr``:
ru: Idris определяет несколько простых типов: ``Int``, ``Integer`` и ``Float`` для числовых операций, ``Char`` и ``String`` для обработки текста, и ``Ptr``, для работы с внешними указателями. Есть также несколько типов объявленных в библиотеке, в том числе ``Bool``, со значениями ``True`` и ``False``. Мы можем объявить некоторые константы с этими типами. Введите следующее в файле ``Prims.idr`` и загрузить его в интерактивную среду Idris, набрав ``idris Prims.idr``:

source: An Idris file consists of an optional module declaration (here ``module Prims``) followed by an optional list of imports and a collection of declarations and definitions. In this example no imports have been specified. However Idris programs can consist of several modules and the definitions in each module each have their own namespace. This is discussed further in Section :ref:`sect-namespaces`). When writing Idris programs both the order in which definitions are given and indentation are significant. Functions and data types must be defined before use, incidently each definition must have a type declaration, for example see ``x : Int``, ``foo : String``, from the above listing. New declarations must begin at the same level of indentation as the preceding declaration. Alternatively, a semicolon ``;`` can be used to terminate declarations.
ru: Idris файл состоит из необязательной декларации модуля (``module Prims``) с последующими дополнительным списком импорта и набора объявлений и определений. В этом примере нет импорта. Idris программы могут состоять из нескольких модулей и определения в каждом модуле имеют свои собственные пространства имен (Это обсуждается далее в разделе::ref:`sect-namespaces`). При написании программы на Idris, порядок, в котором даны определения и отступы имеют значение. Функции и типы данных должны быть определены до использования, при этом каждое определение должно иметь объявление типа, например: ``x : Int``, ``foo : String``, из приведенного выше кода. Новые объявления должны иметь тот же уровень отступа, как и в предыдущем объявлении. Кроме того, точка с запятой ``;`` может быть использована для прекращения объявления.

source: A library module ``prelude`` is automatically imported by every Idris program, including facilities for IO, arithmetic, data structures and various common functions. The prelude defines several arithmetic and comparison operators, which we can use at the prompt. Evaluating things at the prompt gives an answer, and the type of the answer. For example:
ru: Модуль стандартной библиотеки ``prelude`` автоматически импортируется в каждой Idris программе, в том числе работа с IO, арифметика, структуры и различные общие функции. ``prelude`` определяет несколько арифметических операторов и операторов сравнения, которые мы можем использовать в командной

source: All of the usual arithmetic and comparison operators are defined for the primitive types. They are overloaded using type classes, as we will discuss in Section :ref:`sect-classes` and can be extended to work on user defined types. Boolean expressions can be tested with the ``if...then...else`` construct, for example:
ru: Все обычные арифметические операторы и операторы сравнения определены для примитивных типов. Они перегружены с использованием ``классов типов``, подробнее в разделе: :ref:`sect-classes` и могут быть расширены для работы с типами определёнными пользователем. Логические выражения могут быть проверены с использованием ``if...then...else``, например:

source: Data Types
ru: Типы данных

source: Data types are declared in a similar way and with similar syntax to Haskell. Natural numbers and lists, for example, can be declared as follows:
ru: Типы данных объявляются по аналогии с синтаксисом Haskell. Натуральные числа и списки, например, могут быть объявлен следующим образом:

source: The above declarations are taken from the standard library. Unary natural numbers can be either zero (``Z``), or the successor of another natural number (``S k``). Lists can either be empty (``Nil``) or a value added to the front of another list (``x :: xs``). In the declaration for ``List``, we used an infix operator ``::``. New operators such as this can be added using a fixity declaration, as follows:
ru: Приведенные выше объявления взяты из стандартной библиотеки. Унарные естественные числа могут быть либо нулем (``Z``), или следующим значением (преемником) другого естественного числа (``S k``). Списки могут быть либо пустым (``Nil``) или как добавляемое значение в друой список (``x :: xs``). В определении ``List`` мы использовали инфиксный оператор ``::``. Новые операторы, такие как этот могут быть добавлены используя следующим образом:

source: Functions, data constructors and type constructors may all be given infix operators as names. They may be used in prefix form if enclosed in brackets, e.g. ``(::)``. Infix operators can use any of the symbols:
ru: Функции, конструкторы данных и конструкторы типа могут быть инфикс операторами. Они могут быть использованы в виде префикса, например, ``(::)``. Инфиксные операторы могут использовать любые символы:

source: Functions
ru: Функции

source: Functions are implemented by pattern matching, again using a similar syntax to Haskell. The main difference is that Idris requires type declarations for all functions, using a single colon ``:`` (rather than Haskell’s double colon ``::``). Some natural number arithmetic functions can be defined as follows, again taken from the standard library:
ru: Функции реализуются паттерн матчингом, используя похожий на Haskell синтаксис. Главное отличие в том, что в Idris требуется явное объявления типов для всех функций, используя одно двоеточие ``:`` (вместо ``::``). Арифметическая функция с натуральным числом может быть определена как:

source: The standard arithmetic operators ``+`` and ``*`` are also overloaded for use by ``Nat``, and are implemented using the above functions. Unlike Haskell, there is no restriction on whether types and function names must begin with a capital letter or not. Function names (``plus`` and ``mult`` above), data constructors (``Z``, ``S``, ``Nil`` and ``::``) and type constructors (``Nat`` and ``List``) are all part of the same namespace. We can test these functions at the Idris prompt:
ru: Стандартные арифметические операторы ``+` и ``*`` также перегружены для использования с ``Nat`` и реализованы с использованием указанных выше функций. В отличие от Haskell, типы или имена функций могут начинаются с заглавной буквы или нет. Имена функций (``plus`` и ``mult``) , конструкторы данных (``Z``, ``S``, ``Nil`` и ``::``) и конструкторы типов (``Nat`` и ``List``) являются частью того же пространства имен. "возможно проверить эти функции в строке Idris:

source: Idris automatically desugars the ``Nat`` representation into a more human readable format. The result of ``plus (S (S Z)) (S (S Z))`` is actually ``(S (S (S (S Z))))`` which is the Integer 4. This can be checked at the Idris prompt:
ru: Idris автоматически раскладывает ``Nat`` в более понятный для чтения формат. Результ ``plus (S (S Z)) (S (S Z))`` фактически ``(S (S (S (S Z))))``, но мы видим целое 4. Это может быть проверено в Idris:

source: Like arithmetic operations, integer literals are also overloaded using type classes, meaning that we can also test the functions as follows:
ru: Как арифметические операции, целые литералы также перегружены с использованием классов типов, это означает, что мы можем протестировать функции следующим образом:

source: You may wonder, by the way, why we have unary natural numbers when our computers have perfectly good integer arithmetic built in. The reason is primarily that unary numbers have a very convenient structure which is easy to reason about, and easy to relate to other data structures as we will see later. Nevertheless, we do not want this convenience to be at the expense of efficiency. Fortunately, Idris knows about the relationship between ``Nat`` (and similarly structured types) and numbers. This means it can optimise the representation, and functions such as ``plus`` and ``mult``.
ru: Вы можете задаться вопросом, почему у нас есть одноместные натуральные числа, когда наши компьютеры хорошо используют целочисленную арифметику. Причина в том, в первую очередь, что унарные номера имеют очень удобную конструкцию, которую легко связать с другими структурами данных, как мы увидим позже. Тем не менее, мы не хотим платить за это удобство в счет эффективности.К счастью, Idris знает об отношениях между ``Nat`` (А так же структурированными типами) и числами. Это означает, что можно оптимизировать представление и функции, такие как ``plus`` и ``mult``.

source: ``where`` clauses
ru: ``where`` положения

source: Functions can also be defined *locally* using ``where`` clauses. For example, to define a function which reverses a list, we can use an auxiliary function which accumulates the new, reversed list, and which does not need to be visible globally:
ru: Функции могут быть определены *локально* с помощью ``where`` положения. Например, чтобы определить функцию, которая переворачивает список, мы можем использовать вспомогательные функции, которые аккумулируют новый, перевернутый список, и которые не будут видмиы за пределами функции:

source: Indentation is significant — functions in the ``where`` block must be indented further than the outer function.
ru: Отступ является значительным - функции в ``where`` блоке должны находиться отступом дальше внешних функций.

source: Scope
ru: Охват

source: Any names which are visible in the outer scope are also visible in the ``where`` clause (unless they have been redefined, such as ``xs`` here). A name which appears only in the type will be in scope in the ``where`` clause if it is a *parameter* to one of the types, i.e. it is fixed across the entire structure.
ru: Любые имена, которые видны на внешними границами также видна в ``where`` (если они не были переопределены, такие как ``xs`` здесь). Имя, которое появляется только в типе будет находиться в области видимости ``where`` если это *параметр* к одному из типов, т.е. фиксированный по всей структуре.

source: As well as functions, ``where`` blocks can include local data declarations, such as the following where ``MyLT`` is not accessible outside the definition of ``foo``:
ru: Также функции, ``where`` блоки могут включать в себя локальные объявления данных, как в примере, где ``MyLT`` не доступен за пределами определения ``foo``:

source: In general, functions defined in a ``where`` clause need a type declaration just like any top level function. However, the type declaration for a function ``f`` *can* be omitted if:
ru: В целом, для функций определенных в ``where`` необходимо объявление типа как и в любой функции топ уровня. Тем не менее, объявление типа для функции ``f`` *может* быть опущено, если:

source: ``f`` appears in the right hand side of the top level definition
ru: ``f`` находится в правой части определения топ уровня

source: The type of ``f`` can be completely determined from its first application
ru: Тип ``f`` может быть полностью определён с первого применения

source: So, for example, the following definitions are legal:
ru: Так, например, следующие определения являются приемлемыми:

source: Dependent Types
ru: Зависимые типы

source: Vectors
ru: Векторы

source: A standard example of a dependent type is the type of “lists with length”, conventionally called vectors in the dependent type literature. They are available as part of the Idris library, by importing ``Data.Vect``, or we can declare them as follows:
ru: Стандартный пример зависимого типа тип “списки с длиной”, условно называемые векторы в литературе о зависимых типах. Они доступны как часть библиотеки Idris, импортируя ``Data.Vect``, или мы может объявить их следующим образом:

source: Note that we have used the same constructor names as for ``List``. Ad-hoc name overloading such as this is accepted by Idris, provided that the names are declared in different namespaces (in practice, normally in different modules). Ambiguous constructor names can normally be resolved from context.
ru: Обратите внимание, что мы использовали те же самые имена конструкторов как для ``List``. Ad-Hoc перегрузки имён, такие как это, приняты в Idris, при условии, что имена объявлены в разных пространствах имен (на практике, как правило, в разных модулях). Неоднозначные имена конструкторов обычно можно решить из контекста.

source: This declares a family of types, and so the form of the declaration is rather different from the simple type declarations above. We explicitly state the type of the type constructor ``Vect`` — it takes a ``Nat`` and a type as an argument, where ``Type`` stands for the type of types. We say that ``Vect`` is *indexed* over ``Nat`` and *parameterised* by ``Type``. Each constructor targets a different part of the family of types. ``Nil`` can only be used to construct vectors with zero length, and ``::`` to construct vectors with non-zero length. In the type of ``::``, we state explicitly that an element of type ``a`` and a tail of type ``Vect k a`` (i.e., a vector of length ``k``) combine to make a vector of length ``S k``.
ru: Это объявления семейства типов, а так формы декларации довольно сильно отличается от простых деклараций типа выше. Мы явно указаем тип тип конструктора ``Vect`` - он принимает ``Nat`` и тип в качестве аргумента, где ``Type`` служит для типа типов. Мы говорим, что ``Vect`` является *индексированным* по ``Nat`` и *параметризируются* через ``Type``. Каждый конструктор нацелен на соответсвующую часть семейства типов. ``Nil`` может быть использован только для создания векторов с нулевой длиной, и ``::`` для построению вектора ненулевой длины. В типе ``::``, мы объявляем явно, что элемент типа ``a`` и хвост типа ``Vect ka`` (то есть, вектор длины ``k``) объединяются, чтобы сделать вектор длиной ``S k``.

source: We can define functions on dependent types such as ``Vect`` in the same way as on simple types such as ``List`` and ``Nat`` above, by pattern matching. The type of a function over ``Vect`` will describe what happens to the lengths of the vectors involved. For example, ``++``, defined as follows, appends two ``Vect``:
ru: Мы можем определить функции для зависимых типов, таких как ``Vect`` таким же образом, а простых типов, таких как ``List`` и ``Nat`` выше, путем сопоставления с образцом. Тип функции над ``Vect`` будет описывать то, что происходит с длинами вовлеченных векторов. Например, ``++``, определяется следующим образом (слияние двух ``Vect``):

source: The type of ``(++)`` states that the resulting vector’s length will be the sum of the input lengths. If we get the definition wrong in such a way that this does not hold, Idris will not accept the definition. For example:
ru: Тип ``(++)`` говорит о том, что длина результирующего вектора будет ровняться сумме входных длин. Если это условие не выполняется, то Idris не примет определение. Например:

source: When run through the Idris type checker, this results in the following:
ru: При запуске механизма проверки типов Idris, результат будет следующим:

source: This error message suggests that there is a length mismatch between two vectors — we needed a vector of length ``k + m``, but provided a vector of length ``k + k``.
ru: Это сообщение об ошибке показывает несоответствие между длиной векторов, между необходимой длиной ``к + m`` и пользовательской ``k + k``.

source: The Finite Sets
ru: Конечные множества

source: Finite sets, as the name suggests, are sets with a finite number of elements. They are available as part of the Idris library, by importing ``Data.Fin``, or can be declared as follows:
ru: Конечные множества, как следует из названия, представляют собой наборы с конечным числом элементов. Они доступны как часть библиотеки Idris, импортируя ``Data.Fin``, или могут быть объявлены следующим образом:

source: From the signature, we can see that this is a type constructor that takes a ``Nat``, and produces a type. So this is not a set in the sense of a collection that is a container of objects, rather it is the canonical set of unnamed elements, as in "the set of 5 elements," for example. Effectively, it is a type that captures integers that fall into the range of zero to ``(n - 1)`` where ``n`` is the argument used to instantiate the ``Fin`` type. For example, ``Fin 5`` can be thought of as the type of integers between 0 and 4.
ru: От сигнатуры, мы можем видеть, что это конструктор типа, который принимает ``Nat`` и объявляет тип. В этом случае это не коллекция, а канонический набор безымянных элементы, как в "множестве 5 элементов, ", например. По сути, это тип, который захватывает целые числа, которые попадают в диапазон от нуля до ``(n - 1)``, где ``n`` - это аргумент, используемый для создания экземпляра ``Fin`` типа. Например, ``Fin 5`` можно рассматривать как тип целых чисел от 0 до 4.

source: Let us look at the constructors in greater detail.
ru: Давайте посмотрим на конструкторы более подробно.

source: ``FZ`` is the zeroth element of a finite set with ``S k`` elements; ``FS n`` is the ``n+1``\ th element of a finite set with ``S k`` elements. ``Fin`` is indexed by a ``Nat``, which represents the number of elements in the set. Since we can’t construct an element of an empty set, neither constructor targets ``Fin Z``.
ru: ``FZ`` является нулевым элементом конечного множества ``S k`` элементов; ``FS n`` - ``n + 1``ый элемент конечного множества с ``S k`` элементами. ``Fin`` индексируется ``Nat``, который представляет количество элементов в наборе. Поскольку мы не можем построить элемент из пустого множества, не существует конструктора для ``Fin Z``.

source: As mentioned above, a useful application of the ``Fin`` family is to represent bounded natural numbers. Since the first ``n`` natural numbers form a finite set of ``n`` elements, we can treat ``Fin n`` as the set of integers greater than or equal to zero and less than ``n``.
ru: Как упоминалось выше, полезное применение ``Fin`` может быть в представление среза натуральных чисел. Мы можем рассматривать ``Fin n`` как набор целых числел, большие или равные нулю и меньше, чем ``n``.

source: For example, the following function which looks up an element in a ``Vect``, by a bounded index given as a ``Fin n``, is defined in the prelude:
ru: Например, следующая функция, для доступа к элементу в ``Vect``, по ограничению индекса в качестве ``Fin n``, определяется в Prelude библиотеке:

source: This function looks up a value at a given location in a vector. The location is bounded by the length of the vector (``n`` in each case), so there is no need for a run-time bounds check. The type checker guarantees that the location is no larger than the length of the vector, and of course no less than zero.
ru: Эта функция ищет значение в данном месте в векторе. Расположение ограничено длиной вектора (``n`` в каждом случае), так что не существует нужды для выполнения проверки границ. Проверка типов гарантирует, что расположение не больше, чем длина вектора, и, конечно, не меньше нуля.

source: Note also that there is no case for ``Nil`` here. This is because it is impossible. Since there is no element of ``Fin Z``, and the location is a ``Fin n``, then ``n`` can not be ``Z``. As a result, attempting to look up an element in an empty vector would give a compile time type error, since it would force ``n`` to be ``Z``.
ru: Отметим также, что тут нет варианта для ``Nil``. Это потому, что так как не существует ни одного элемента из ``Fin Z`` с положенем ``Fin n``, то ``n`` не может быть ``Z``. В результате, попытка искать элемент в пустом вектора выдаст ошибку типа на этапе компиляции.

source: Implicit Arguments
ru: Неявные аргументы

source: Let us take a closer look at the type of ``index``:
ru: Давайте внимательнее посмотрим на тип ``index``:

source: It takes two arguments, an element of the finite set of ``n`` elements, and a vector with ``n`` elements of type ``a``. But there are also two names, ``n`` and ``a``, which are not declared explicitly. These are *implicit* arguments to ``index``. We could also write the type of ``index`` as:
ru: Он принимает два аргумента, элемент конечного множества ``n`` элементов, и вектор с ``n`` элементами типа ``a``. Но ``n`` и ``a`` не объявлены явно. Это *неявные* аргументы ``index``. Мы также могли бы написать тип ``index`` как:

source: Implicit arguments, given in braces ``{}`` in the type declaration, are not given in applications of ``index``; their values can be inferred from the types of the ``Fin n`` and ``Vect n a`` arguments. Any name beginning with a lower case letter which appears as a parameter or index in a type declaration, but which is otherwise unbound, will be automatically bound as an implicit argument. Implicit arguments can still be given explicitly in applications, using ``{a=value}`` and ``{n=value}``, for example:
ru: Неявные аргументы, приведены в скобках ``{}`` в декларации типа, не приведены в приложениях ``index``, их значения могут быть выведены из типов ``Fin n`` и аргументов ``Vect n a``. Любое имя, начинающиеся с маленькой буквой, которое появляется в качестве параметра или индекса в описании типа, но не связанное, будет автоматически связано, как неявный аргумент. Неявные аргументы могут быть обозначены явно в приложениях, используя ``{а = значение}`` и ``{n = значение}``, например:

source: In fact, any argument, implicit or explicit, may be given a name. We could have declared the type of ``index`` as:
ru: На самом деле, любому аргументу, явному или неявному, может быть дано имя. Мы могли бы объявить тип ``index`` как:

source: It is a matter of taste whether you want to do this — sometimes it can help document a function by making the purpose of an argument more clear.
ru: Это дело вкуса, хотите ли вы использовать это, но иногда это может помочь документировать функцию, делая назначения аргумента более понятными.

source: “``using``” notation
ru: ``using`` нотация

source: Sometimes it is useful to provide types of implicit arguments, particularly where there is a dependency ordering, or where the implicit arguments themselves have dependencies. For example, we may wish to state the types of the implicit arguments in the following definition, which defines a predicate on vectors:
ru: Иногда полезно указывать типы неявных аргументов, особенно там, где важен порядок зависимостей, или там, где неявные аргументы сами по себе имеют зависимостей. Например, мы можем указывать типы неявных аргументов как в примере объявления предиката на векторах:

source: An instance of ``Elem x xs`` states that ``x`` is an element of ``xs``. We can construct such a predicate if the required element is ``Here``, at the head of the vector, or ``There``, in the tail of the vector. For example:
ru: Экземпляр ``Elem x xs`` утверждает, что ``x`` является элементом ``xs``. Мы можем построить такой предикат, если требуемый элемент ``Here`` находится в голове (в начале) вектора, или ``There`` находится в хвосте вектора:
