Repository: idris-lang/Idris-dev
Catalog: docs/locale/*/LC_MESSAGES/tutorial/typesfuns.po
Languages: ru

source: Idris also provides a convenient syntax for accessing and updating nested records. For example, if a field is accessible with the expression ``c (b (a x))``, it can be updated using the following syntax:
ru: Idris также предоставляет удобный синтаксис для доступа и обновления вложенных записей. Например, если поле доступно с выражением ``c (b (a x))``, оно может быть обновлено, используя следующий синтаксис:

source: This returns a new record, with the field accessed by the path ``a->b->c`` set to ``x``. The syntax is first class, i.e. ``record { a->b->c = val }`` itself has a function type. Symmetrically, the field can also be accessed with the following syntax:
ru: Это возвращает новую запись, с полем доступ по пути ``a->b->c`` установленом в ``x``. Синтаксис первого класса ``record { a->b->c = val }`` имеет тип функции. Симметрично, поле также можно получить следующим синтаксисом:

source: Parameters and Fields
ru: Параметры и поля

source: Records can have *parameters*, which are not subject to field updates. The parameters appear as arguments to the resulting type, and are written following the record type name. For example, a pair type could be defined as follows:
ru: Записи могут иметь *параметры*, которые не подлежат обновлению. Параметры применяются в качестве аргументов к зависимым типам, и пишутся после имени типа записи. Например, тип пара может быть определен следующим образом:

source: The parameters to a record type need not be types. For example, we can restrict the size of classes using a ``Nat`` parameter to the ``Class`` record:
ru: Параметры для типа записи не должны быть типами. Например, мы можем ограничить размер классов, используя параметр ``Nat`` к ``Class`` записи:

source: Note that it is no longer possible to write ``addStudent`` for this type, as that would change the size of the class.
ru: Обратите внимание, что больше не возможно использовать ``addStudent`` для этого типа, что бы изменить размер класса.
